<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>Resources/Info.plist</key>
		<data>
		kH+OInav51zg6VVY9l6CIe/suvA=
		</data>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/coremldata.bin</key>
		<data>
		LzZgCjOO+PzOMoOaGy7zuBm6mz8=
		</data>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/coremldata.bin</key>
		<data>
		1KiIvc0qomGA8H+SVkQ+bFzNBB8=
		</data>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/model.espresso.net</key>
		<data>
		8gc1ERtT/9+K0a8gD2NYc9jiO9M=
		</data>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/model.espresso.shape</key>
		<data>
		um4PTiu08KtqdWl0lqrwy4mdSvY=
		</data>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/model.espresso.weights</key>
		<data>
		3n/l8fGfHpGD8z6h2f2fbJJ3Vro=
		</data>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/model/coremldata.bin</key>
		<data>
		ywn4n/q5e9oWqKg072wL3kxD++I=
		</data>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<data>
		3oqEe/+MND1puFOiFebud17y75Y=
		</data>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model1/coremldata.bin</key>
		<data>
		es1r3NP7WcqNuU58Pzqca0MSMNk=
		</data>
		<key>Resources/beep-offic.m4a</key>
		<data>
		8OATG2Cjk+cXl2kfJ8hsgIrEjy4=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>Resources/Info.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			mEBVu7Hjz6WpqpWskKq62tSf+OMARGB1yZRAHQgm89E=
			</data>
		</dict>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			1KWxZ7w7nco4rDsDcA9WQYuNelEZCH9rOxNMR5XwpFU=
			</data>
		</dict>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			61FpnWdoHTC9j8pJV821cPQglUMDiU7JEh5966TSQ4I=
			</data>
		</dict>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			4Cvv80YXlosBhU6X5YuoaWcaYONazVQdhGB2xk6XZ4c=
			</data>
		</dict>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			iePH/bSXO5xayxLtjsu34H/DgJ+hPV7nBHMrR3jbRhk=
			</data>
		</dict>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			xvQuieoT/RTCyeAsaN4wMgPzGEcuE2hkaa7jdS9Qnww=
			</data>
		</dict>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			5dyN3LM4GYt7lwcO9RVnniqLVWBb4ulR7mi8PQho7bg=
			</data>
		</dict>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model0/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			Zmh6rfhivXdsj8GLjp+OIAiXFIVu4jOzkCpZHQ1fKSU=
			</data>
		</dict>
		<key>Resources/NoTouch_YOLO_2.mlmodelc/model1/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			m/nuhiMnRJwbm/hmVegpxIGM6pmCEw37TytlmNf0/K8=
			</data>
		</dict>
		<key>Resources/beep-offic.m4a</key>
		<dict>
			<key>hash2</key>
			<data>
			bNQDdQvDwYytDBdr6FdMzL6K8bM0rBlKeP6I/6BYz20=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^Resources/</key>
		<true/>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^(Frameworks|SharedFrameworks|PlugIns|Plug-ins|XPCServices|Helpers|MacOS|Library/(Automator|Spotlight|LoginItems))/</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^Resources/.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^Resources/.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Resources/Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^[^/]+$</key>
		<dict>
			<key>nested</key>
			<true/>
			<key>weight</key>
			<real>10</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
